of2306/buoyantSimpleFoam/hotRadiationRoom-modified/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            sets;
libs            (sampling);
interpolationScheme cellPointFace;
setFormat       raw;

fields          ( T U );

sets
{
    z0.0
    {
        type            face;
        axis            y;
        start           (1 0 0);
        end             (1 6 0);
    }
    z0.5
    {
        type            face;
        axis            y;
        start           (1 0 0.5);
        end             (1 6 0.5);
    }
    z1.0
    {
        type            face;
        axis            y;
        start           (1 0 1.0);
        end             (1 6 1.0);
    }
    z1.5
    {
        type            face;
        axis            y;
        start           (1 0 1.5);
        end             (1 6 1.5);
    }
    z2.0
    {
        type            face;
        axis            y;
        start           (1 0 2.0);
        end             (1 6 2.0);
    }

    y0
    {
        type            face;
        axis            z;
        start           (1 0 0);
        end             (1 0 2);
    }
    y1
    {
        type            face;
        axis            z;
        start           (1 1 0);
        end             (1 1 2);
    }
    y2
    {
        type            face;
        axis            z;
        start           (1 2 0);
        end             (1 2 2);
    }
    y3
    {
        type            face;
        axis            z;
        start           (1 3 0);
        end             (1 3 2);
    }
    y4
    {
        type            face;
        axis            z;
        start           (1 4 0);
        end             (1 4 2);
    }
    y5
    {
        type            face;
        axis            z;
        start           (1 5 0);
        end             (1 5 2);
    }
    y6
    {
        type            face;
        axis            z;
        start           (1 6 0);
        end             (1 6 2);
    }

}


// ************************************************************************* //
